Feature: Регистрация на потребител  

  Scenario: Регистрация на потребител, който вече съществува 
    Given Потребителят отваря екрана за регистрация в системата
    And Отваря се формата за регистрация
    When Потребителят избира типа потребител "0"
    And Потребителят въвежда потребителско име "ivanella11"
    And Потребителят въвежда парола "123456"
    And Потребителят натиска бутона за правене на паролата видима
    And Потребителят въвежда е-mail "iv11_v@abv.bg"
    And Потребителят въвежда телефонен номер "0984572021"    
    And Натиска бутона за регистрация
    Then Изписва се съобщение "Потребителят съществува!"

  Scenario: Успешна регистрация на потребител 
    Given Потребителят отваря екрана за регистрация в системата
    And Отваря се формата за регистрация
    When Потребителят избира типа потребител "2"
    And Потребителят въвежда потребителско име "marko44"
    And Потребителят въвежда парола "nomoreMercy60"
    And Потребителят натиска бутона за правене на паролата видима
    And Потребителят въвежда е-mail "markmark56@outlook.com"
    And Потребителят въвежда телефонен номер "0884672955"    
    And Натиска бутона за регистрация
    Then Изписва се съобщение "Регистрирахте се успешно!"
    
  Scenario: Регистрация с грешен тип на потребителя
    Given Потребителят отваря екрана за регистрация в системата
    And Отваря се формата за регистрация
    When Потребителят избира типа потребител "5"
    And Потребителят въвежда потребителско име "vankos"
    And Потребителят въвежда парола "heyyo87"
    And Потребителят натиска бутона за правене на паролата видима
    And Потребителят въвежда е-mail "vanks@outlook.com"
    And Потребителят въвежда телефонен номер "0884567758"    
    And Натиска бутона за регистрация
    Then Изписва се съобщение "Такъв тип на потребителя не съществува!"

  Scenario: Невъведени email и телефон при регистрация  
    Given Потребителят отваря екрана за регистрация в системата
    And Отваря се формата за регистрация
    When Потребителят избира типа потребител "0"
    And Потребителят въвежда потребителско име "ivanella11"
    And Потребителят въвежда парола "123456"
    And Потребителят натиска бутона за правене на паролата видима
    And Потребителят въвежда е-mail ""
    And Потребителят въвежда телефонен номер ""    
    And Натиска бутона за регистрация
    Then Изписва се съобщение "Това e/са задължителни полета!"

