Feature: Възстановяване на забравена парола

  Scenario: Възстановяване на паролата чрез email
    Given Потребителят отваря екрана за забравена парола
    And Отваря се формата за възстановяване на паролата
    When Потребителят въвежда потребителско име "ivanella11"
    And Потребителят постъпва към потвърждаване на самоличността си "iv11_v@abv.bg"
    And Натиска бутона за възстановяване на паролата
    Then Изписва се съобщение "Изпратен е линк в пощата Ви за възстановяване на паролата!"

  Scenario: Невъзможно възстановяване на паролата, защото са въведени неправилни потребителски данни
    Given Потребителят отваря екрана за забравена парола
    And Отваря се формата за възстановяване на паролата
    When Потребителят въвежда потребителско име "ivane"
    And Потребителят постъпва към потвърждаване на самоличността си "anemail123@gmail.com"
    And Натиска бутона за възстановяване на паролата
    Then Изписва се съобщение "Няма информация за този потребител в базата данни!"
    
  Scenario: Възстановяване на паролата чрез телефонен номер
    Given Потребителят отваря екрана за забравена парола
    And Отваря се формата за възстановяване на паролата
    When Потребителят въвежда потребителско име "ivanella11"
    And Потребителят постъпва към потвърждаване на самоличността си "0984572021"
    And Натиска бутона за възстановяване на паролата
    Then Изписва се съобщение "Изпратен е код за възстановяване на паролата в телефона Ви!"
    
  Scenario: Възстановяване на паролата чрез телефонен номер
    Given Потребителят отваря екрана за забравена парола
    And Отваря се формата за възстановяване на паролата
    When Потребителят въвежда потребителско име "ivanella11"
    And Потребителят постъпва към потвърждаване на самоличността си "0984572221"
    And Натиска бутона за възстановяване на паролата
    Then Изписва се съобщение "Няма информация за този потребител в базата данни!"