Feature: Записване на дете в класиране

  Scenario: Записване на дете, което вече съществува
    Given Потребителят отваря екрана за регистрация на дете в системата
    And Отваря се формата за регистрация на дете
    When Потребителят въвежда име на детето "Иван Петров"
    And Потребителят определя дали единият от родителите работи "1"
    And Потребителят определя дали и другият родител работи "1"
    And Потребителят определя дали детето има увреждания "0"
    And Потребителят определя дали детето има близнак "0"
    And Потребителят определя дали детето има брат/сестра в детското заведение "1"
    And Потребителят въвежда име на брат/сестра в детското заведение "Иванa Петровa"
    And Натиска бутона въвеждане на ново дете в системата
    Then Изписва се съобщение "В системата има запис за това дете!" 
    And Изписва се общия брой точки "Проверено! Детето ви има 3 точки!"
    
  Scenario: Успешнo записване на дете в класирането
    Given Потребителят отваря екрана за регистрация на дете в системата
    And Отваря се формата за регистрация на дете
    When Потребителят въвежда име на детето "Юлия Тодорова"
    And Потребителят определя дали единият от родителите работи "1"
    And Потребителят определя дали и другият родител работи "1"
    And Потребителят определя дали детето има увреждания "2"
    And Потребителят определя дали детето има близнак "0"
    And Потребителят определя дали детето има брат/сестра в детското заведение "0"
    And Потребителят въвежда име на брат/сестра в детското заведение ""
    And Натиска бутона въвеждане на ново дете в системата
    Then Изписва се съобщение "Регистрирахте детето си успешно!" 
    And Изписва се общия брой точки "Детето ви има 4 точки!"
    
  Scenario: Грешка при бало-/точкообразуване на детето
    Given Потребителят отваря екрана за регистрация на дете в системата
    And Отваря се формата за регистрация на дете
    When Потребителят въвежда име на детето "Валентин Атанасов"
    And Потребителят определя дали единият от родителите работи "3"
    And Потребителят определя дали и другият родител работи "1"
    And Потребителят определя дали детето има увреждания "0"
    And Потребителят определя дали детето има близнак "2"
    And Потребителят определя дали детето има брат/сестра в детското заведение "1"
    And Потребителят въвежда име на брат/сестра в детското заведение "Георги Атанасов"
    And Натиска бутона въвеждане на ново дете в системата
    Then Изписва се съобщение "Неправилни стойности за точки на детето Ви!"
    And Изписва се общия брой точки "Грешка!"
    
  Scenario: Успешнo записване на дете, което има брат/сестра в детското заведение, в класирането
    Given Потребителят отваря екрана за регистрация на дете в системата
    And Отваря се формата за регистрация на дете
    When Потребителят въвежда име на детето "Валентин Атанасов"
    And Потребителят определя дали единият от родителите работи "0"
    And Потребителят определя дали и другият родител работи "1"
    And Потребителят определя дали детето има увреждания "0"
    And Потребителят определя дали детето има близнак "1"
    And Потребителят определя дали детето има брат/сестра в детското заведение "1"
    And Потребителят въвежда име на брат/сестра в детското заведение "Георги Атанасов"
    And Натиска бутона въвеждане на ново дете в системата
    Then Изписва се съобщение "Регистрирахте детето си успешно!"
    And Изписва се общия брой точки "Проверено! Детето ви има 3 точки!"
    
  Scenario: Грешни входни данни за име нa брат/сестра в детското заведение на детето
    Given Потребителят отваря екрана за регистрация на дете в системата
    And Отваря се формата за регистрация на дете
    When Потребителят въвежда име на детето "Юлия Атанасова"
    And Потребителят определя дали единият от родителите работи "1"
    And Потребителят определя дали и другият родител работи "1"
    And Потребителят определя дали детето има увреждания "2"
    And Потребителят определя дали детето има близнак "0"
    And Потребителят определя дали детето има брат/сестра в детското заведение "1"
    And Потребителят въвежда име на брат/сестра в детското заведение "Теодор Атанасов"
    And Натиска бутона въвеждане на ново дете в системата
    Then Изписва се съобщение "Проверете въведеното име за брат/сестра в детското заведение!"
    And Изписва се общия брой точки "Няма такова дете в системата! Детето ви има 4 точки!"