Feature: Вход в системата

  Scenario: Вход в системата
    Given Потребителят отваря екрана за вход
    And Отваря се форма за вход в системата
    When Потребителят избира типа потребител "0"
    And Потребителят въвежда потребителско име "ivanella11"
    And Потребителят въвежда парола "123456"
    And Натиска бутона за вход в системата
    Then Изписва се съобщение "Успешен вход в профила!"

  Scenario: Вход в системата с грешен тип на потребителя
    Given Потребителят отваря екрана за вход
    And Отваря се форма за вход в системата
    When Потребителят избира типа потребител "3"
    And Потребителят въвежда потребителско име "ivanella11"
    And Потребителят въвежда парола "123456"
    And Натиска бутона за вход в системата
    Then Изписва се съобщение "Такъв тип на потребителя не съществува!"

  Scenario: Вход в системата с грешна парола
    Given Потребителят отваря екрана за вход
    And Отваря се форма за вход в системата
    When Потребителят избира типа потребител "0"
    And Потребителят въвежда потребителско име "ivanella11"
    And Потребителят въвежда парола "12345"
    And Натиска бутона за вход в системата
    Then Изписва се съобщение "Грешна парола!"

  Scenario: Вход в системата без да има регистрация
    Given Потребителят отваря екрана за вход
    And Отваря се форма за вход в системата
    When Потребителят избира типа потребител "0"
    And Потребителят въвежда потребителско име "vancho"
    And Потребителят въвежда парола "654321"
    And Натиска бутона за вход в системата
    Then Изписва се съобщение "Няма регистрация за този потребител!"